openfoam_template/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.375;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.375;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.375;
        value           uniform 0.375;
    }

    topAndBottom
    {
        type            slip;
    }

    frontPlane
    {
        type            empty;
    }

    backPlane
    {
        type            empty;
    }

    wing
    {
        type            kqRWallFunction;
        value           uniform 0.375;
    }
}

// ************************************************************************* //
