openfoam_template/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-5;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 1e-5;
    }

    outlet
    {
        type            calculated;
        value           uniform 1e-5;
    }

    topAndBottom
    {
        type            slip;
    }

    frontPlane
    {
        type            empty;
    }

    backPlane
    {
        type            empty;
    }

    wing
    {
        type            nutkWallFunction;
        value           uniform 1e-5;
    }
}

// ************************************************************************* //
