openfoam_template/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-5.0 -4.0 -0.05) // 0
    (10.0 -4.0 -0.05) // 1
    (10.0  4.0 -0.05) // 2
    (-5.0  4.0 -0.05) // 3
    (-5.0 -4.0  0.05) // 4
    (10.0 -4.0  0.05) // 5
    (10.0  4.0  0.05) // 6
    (-5.0  4.0  0.05) // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (150 80 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }
    topAndBottom
    {
        type patch;
        faces
        (
            (3 2 6 7)
            (0 4 5 1)
        );
    }
    frontPlane
    {
        type patch; // Must be type patch during snappyHexMesh, then set to empty after extrusion
        faces
        (
            (0 1 2 3)
        );
    }
    backPlane
    {
        type patch; // Must be type patch during snappyHexMesh, then set to empty after extrusion
        faces
        (
            (4 7 6 5)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
